modm-ext/data.modm.io/docs/svd/header_stm32f091xc.svd
        <register>
          <name>CSELR</name>
          <description>Channel selection register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1_ADC</name>
              <description>Remap ADC on DMA1 Channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1_USART3_RX</name>
              <description>Remap USART3 Rx on DMA1 channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_ADC</name>
              <description>Remap ADC on DMA1 channel 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_I2C1_TX</name>
              <description>Remap I2C1 Tx on DMA1 channel 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_TIM1_CH1</name>
              <description>Remap TIM1 channel 1 on DMA1 channel 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_TIM6_UP</name>
              <description>Remap TIM6 up on DMA1 channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_I2C1_RX</name>
              <description>Remap I2C1 Rx on DMA1 channel 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_TIM1_CH2</name>
              <description>Remap TIM1 channel 2 on DMA1 channel 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_TIM7_UP</name>
              <description>Remap TIM7 up on DMA1 channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_I2C2_TX</name>
              <description>Remap I2C2 Tx on DMA1 channel 4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_TIM2_CH4_1</name>
              <description>Remap TIM2 channel 4 on DMA1 channel 4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_USART2_RX</name>
              <description>Remap USART2 Rx on DMA1 channel 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_I2C2_RX</name>
              <description>Remap I2C2 Rx on DMA1 channel 5</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_TIM1_CH3</name>
              <description>Remap TIM1 channel 3 on DMA1 channel 5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 5</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_USART2_RX</name>
              <description>Remap USART2 Rx on DMA1 channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_I2C1_TX</name>
              <description>Remap I2C1 Tx on DMA1 channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_TIM1_CH1</name>
              <description>Remap TIM1 channel 1 on DMA1 channel 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_TIM2_CH2</name>
              <description>Remap TIM2 channel 2 on DMA1 channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_I2C1_RX</name>
              <description>Remap I2C1 Rx on DMA1 channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_TIM2_CH2_1</name>
              <description>Remap TIM2 channel 2 on DMA1 channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSELR_ALT1</name>
          <description>Channel selection register</description>
          <alternateRegister>CSELR</alternateRegister>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1_TIM17_CH1</name>
              <description>Remap TIM17 channel 1 on DMA1 channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CH1_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_SPI1_RX</name>
              <description>Remap SPI1 Rx on DMA1 channel 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH2_USART5_TX</name>
              <description>Remap USART5 Tx on DMA1 channel 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH3_SPI1_TX</name>
              <description>Remap SPI1 Tx on DMA1 channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH3_USART5_RX</name>
              <description>Remap USART5 Rx on DMA1 channel 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH4_SPI2_RX</name>
              <description>Remap SPI2 Rx on DMA1 channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH4_USART5_TX</name>
              <description>Remap USART5 Tx on DMA1 channel 4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH5_SPI2_TX</name>
              <description>Remap SPI1 Tx on DMA1 channel 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH5_USART5_RX</name>
              <description>Remap USART5 Rx on DMA1 channel 5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH6_SPI2_RX</name>
              <description>Remap SPI2 Rx on DMA1 channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH6_USART5_RX</name>
              <description>Remap USART5 Rx on DMA1 channel 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH7_SPI2_TX</name>
              <description>Remap SPI2 Tx on DMA1 channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH7_USART5_TX</name>
              <description>Remap USART5 Tx on DMA1 channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSELR_ALT2</name>
          <description>Channel selection register</description>
          <alternateRegister>CSELR</alternateRegister>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1_TIM17_UP</name>
              <description>Remap TIM17 up on DMA1 channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CH1_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_ADC</name>
              <description>Remap ADC on DMA1 channel 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_I2C1_TX</name>
              <description>Remap I2C1 Tx on DMA1 channel 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_TIM1_CH1</name>
              <description>Remap TIM1 channel 1 on DMA1 channel 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_TIM6_UP</name>
              <description>Remap TIM6 up on DMA1 channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_I2C1_RX</name>
              <description>Remap I2C1 Rx on DMA1 channel 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_TIM1_CH2</name>
              <description>Remap TIM1 channel 2 on DMA1 channel 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_TIM7_UP</name>
              <description>Remap TIM7 up on DMA1 channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_TIM3_CH1</name>
              <description>Remap TIM3 channel 1 on DMA1 channel 4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH4_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_USART2_RX</name>
              <description>Remap USART2 Rx on DMA1 channel 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_I2C2_RX</name>
              <description>Remap I2C2 Rx on DMA1 channel 5</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_TIM1_CH3</name>
              <description>Remap TIM1 channel 3 on DMA1 channel 5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 5</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_USART2_RX</name>
              <description>Remap USART2 Rx on DMA1 channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_TIM3_CH1</name>
              <description>Remap TIM3 channel 1 on DMA1 channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH6_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_TIM2_CH2</name>
              <description>Remap TIM2 channel 2 on DMA1 channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_I2C1_RX</name>
              <description>Remap I2C1 Rx on DMA1 channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_TIM2_CH2_1</name>
              <description>Remap TIM2 channel 2 on DMA1 channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSELR_ALT3</name>
          <description>Channel selection register</description>
          <alternateRegister>CSELR</alternateRegister>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1_ADC</name>
              <description>Remap ADC on DMA1 Channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1_USART3_RX</name>
              <description>Remap USART3 Rx on DMA1 channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1_USART5_RX</name>
              <description>Remap USART5 Rx on DMA1 channel 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH2_ADC</name>
              <description>Remap ADC on DMA1 channel 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_I2C1_TX</name>
              <description>Remap I2C1 Tx on DMA1 channel 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_TIM1_CH1</name>
              <description>Remap TIM1 channel 1 on DMA1 channel 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_TIM6_UP</name>
              <description>Remap TIM6 up on DMA1 channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_I2C1_RX</name>
              <description>Remap I2C1 Rx on DMA1 channel 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_TIM1_CH2</name>
              <description>Remap TIM1 channel 2 on DMA1 channel 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_TIM7_UP</name>
              <description>Remap TIM7 up on DMA1 channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4_TIM3_TRIG</name>
              <description>Remap TIM3 Trig on DMA1 channel 4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH4_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_USART2_RX</name>
              <description>Remap USART2 Rx on DMA1 channel 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_I2C2_RX</name>
              <description>Remap I2C2 Rx on DMA1 channel 5</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_TIM1_CH3</name>
              <description>Remap TIM1 channel 3 on DMA1 channel 5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 5</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_USART2_RX</name>
              <description>Remap USART2 Rx on DMA1 channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6_TIM3_TRIG</name>
              <description>Remap TIM3 Trig on DMA1 channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CH6_USART1_RX</name>
              <description>Remap USART1 Rx on DMA1 channel 6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_TIM2_CH2</name>
              <description>Remap TIM2 channel 2 on DMA1 channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_I2C1_RX</name>
              <description>Remap I2C1 Rx on DMA1 channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_TIM2_CH2_1</name>
              <description>Remap TIM2 channel 2 on DMA1 channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7_USART1_TX</name>
              <description>Remap USART1 Tx on DMA1 channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
